app/Http/Controllers/CategoriesController.php

select * from `categories`
---
    public function index()
    {
        //
        $categories = Category::all();

select * from `categories` where `categories`.`id` = '6' limit 1
---
    public function show(ShowFormRequest $request, string $id)
    {
        //TODO Implementar ShowFormRequest
        $category = Category::find($id);