app/Http/Controllers/TodosController.php

    public function index (){

        $todos = Todo::all();
        $categories = Category::all();
---
select * from `todos`
select * from `categories`

    public function show (ShowTodoFormRequest $request, $id)
    {
        //TODO Implementar ShowTodoFormRequest COMPLETED
        $todo = Todo::find($id);
        if(!$todo){
            return redirect()->route('todos.index')->with('error', 'La Tarea no existe');
        }
        $categories = Category::all();
---
select * from `todos` where `todos`.`id` = '16' limit 1
select * from `categories`

    public function update (UpdateTodosFormRequest $request, $id){
        $todo = Todo::find($id);
        $todo ->title = $request->title;
        $todo -> category_id = $request->category_id;
        //TODO Cambiar método save por update
        $todo-> update();

        return redirect()->route('todos.index')->with('success', 'Tarea Actualizada Con Exito!');
---
select * from `todos`

    public function generatePDF(){
        $todos = todo::all();
        $categories = Category::all();
        $users = User::all();
---
select * from `categories`
select * from `users`