app/Http/Controllers/UsersController.php

select * from `users`
---
    public function index()
    {
        $users = User::all();

select * from `users` where `users`.`id` = '17' limit 1
---
    public function show(Request $request, $id)
    {
        $user = User::find($id);

select * from `users` where `users`.`id` = '20' limit 1
---
    public function destroy(Request $request, $id)
    {
        $user = User::find($id);