app/Http/Controllers/UsersController.php

delete from `users` where `id` = 20
---
    public function destroy(DeleteUsersFormRequest $request, $id)
    {
        $user = $this->userRepository->delete($id);